Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEServer.c
/*
 * Copyright (c) 2016-2019  Moddable Tech, Inc.
 *
 *   This file is part of the Moddable SDK Runtime.
 * 
 *   The Moddable SDK Runtime is free software: you can redistribute it and/or modify
 *   it under the terms of the GNU Lesser General Public License as published by
 *   the Free Software Foundation, either version 3 of the License, or
 *   (at your option) any later version.
 * 
 *   The Moddable SDK Runtime is distributed in the hope that it will be useful,
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *   GNU Lesser General Public License for more details.
 * 
 *   You should have received a copy of the GNU Lesser General Public License
 *   along with the Moddable SDK Runtime.  If not, see <http://www.gnu.org/licenses/>.
 *
 */
/*
	TBD:
		- Encryption, pairing, bonding
		- Attribute level encryption
 */

#include "xsmc.h"
#include "xsHost.h"
#include "mc.xs.h"
#include "mc.defines.h"
#include "modBLE.h"
#include "modBLECommon.h"

#include "sdk_errors.h"
#include "ble.h"
#include "ble_conn_params.h"
#include "ble_gap.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_freertos.h"
#include "nrf_ble_gatt.h"
#include "nrf_sdh.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"

#define APP_BLE_OBSERVER_PRIO 3
#define FIRST_CONN_PARAMS_UPDATE_DELAY      5000                                    /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY       30000                                   /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT        3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

typedef struct {
	uint8_t service_index;
	uint8_t att_index;
	ble_gatts_char_handles_t handles;
} gatts_handles_t;

#define LOG_GATTS 0
#if LOG_GATTS
	#define LOG_GATTS_EVENT(event) logGATTSEvent(event)
	#define LOG_GATTS_MSG(msg) modLog(msg)
	#define LOG_GATTS_INT(i) modLogInt(i)
#else
	#define LOG_GATTS_EVENT(event)
	#define LOG_GATTS_MSG(msg)
	#define LOG_GATTS_INT(i)
#endif

#define LOG_GAP 0
#if LOG_GAP
	#define LOG_GAP_EVENT(event) logGAPEvent(event)
	#define LOG_GAP_MSG(msg) modLog(msg)
	#define LOG_GAP_INT(i) modLogInt(i)
#else
	#define LOG_GAP_EVENT(event)
	#define LOG_GAP_MSG(msg)
	#define LOG_GAP_INT(i)
#endif

#define LOG_PM 0
#if LOG_PM
	#define LOG_PM_EVENT(event) logPMEvent(event)
	#define LOG_PM_MSG(msg) modLog(msg)
	#define LOG_PM_INT(i) modLogInt(i)
#else
	#define LOG_PM_EVENT(event)
	#define LOG_PM_MSG(msg)
	#define LOG_PM_INT(i)
#endif

#define DEVICE_FRIENDLY_NAME "Moddable"

#include "mc.bleservices.c"

static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);
static void pm_evt_handler(pm_evt_t const * p_evt);

static void bleServerCloseEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void bleServerReadyEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);

static void gapConnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gapDisconnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattsReadAuthRequestEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gapAuthStatusEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattsWriteAuthRequestEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);
static void gattsWriteEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength);

static const char_name_table *handleToCharName(uint16_t handle);

typedef struct {
	xsMachine *the;
	xsSlot obj;

	uint8_t deviceNameSet;

	// connection
	uint16_t conn_handle;
	ble_gap_addr_t remote_bda;
	
	// gatt
	nrf_ble_gatt_t m_gatt;
	
	// advertising
	uint8_t adv_handle_initialized;
	uint8_t adv_handle;
	uint8_t adv_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
	uint8_t scan_rsp_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
	
	// security
	uint8_t encryption;
	uint8_t bonding;
	uint8_t mitm;
	uint8_t iocap;
	uint8_t bond;
} modBLERecord, *modBLE;

static modBLE gBLE = NULL;

#if MODDEF_BLE_MAX_CONNECTIONS != 1
	#error - only one ble client connection supported
#endif

void xs_ble_server_initialize(xsMachine *the)
{
	uint32_t ram_start = 0;
    ble_conn_params_init_t cp_init;
    ret_code_t err_code;
    
	if (NULL != gBLE)
		xsUnknownError("BLE already initialized");
	gBLE = (modBLE)c_calloc(sizeof(modBLERecord), 1);
	if (!gBLE)
		xsUnknownError("no memory");
	gBLE->conn_handle = BLE_CONN_HANDLE_INVALID;
	gBLE->adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
	gBLE->bond = 0xFF;
	gBLE->the = the;
	gBLE->obj = xsThis;
	xsmcSetHostData(xsThis, gBLE);
	xsRemember(gBLE->obj);
	
	// Initialize platform Bluetooth modules
    err_code = nrf_sdh_enable_request();
    if (NRF_SUCCESS == err_code) {
		// Configure the BLE stack using the default BLE settings defined in the sdk_config.h file.
		// Fetch the start address of the application RAM.
		err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    }

    // Enable BLE stack
    if (NRF_SUCCESS == err_code)
    	err_code = nrf_sdh_ble_enable(&ram_start);

	// Initialize GATT module
    if (NRF_SUCCESS == err_code)
		err_code = nrf_ble_gatt_init(&gBLE->m_gatt, NULL);
    
	// Initialize connection parameters (required)
    if (NRF_SUCCESS == err_code) {
		c_memset(&cp_init, 0, sizeof(cp_init));
		cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
		cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
		cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
		err_code = ble_conn_params_init(&cp_init);
    }

	// Initialize the peer manager
    if (NRF_SUCCESS == err_code) {
		err_code = pm_init();
		if (NRF_SUCCESS == err_code) {
			ble_gap_sec_params_t sec_params;
			c_memset(&sec_params, 0, sizeof(ble_gap_sec_params_t));
			sec_params.io_caps        = BLE_GAP_IO_CAPS_NONE;
			sec_params.min_key_size   = 7;
			sec_params.max_key_size   = 16;
			err_code = pm_sec_params_set(&sec_params);
		}
		if (NRF_SUCCESS == err_code)
			err_code = pm_register(pm_evt_handler);
    }

	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble initialization failed");

    // Register a handler for BLE events.
	NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

    // Create a FreeRTOS task for the BLE stack.
	nrf_sdh_freertos_init(NULL, NULL);
    
	modMessagePostToMachine(the, NULL, 0, bleServerReadyEvent, NULL);
}

void xs_ble_server_close(xsMachine *the)
{
	modBLE ble = xsmcGetHostData(xsThis);
	if (!ble) return;

	gBLE = NULL;
	xsForget(ble->obj);
	xsmcSetHostData(xsThis, NULL);
	modMessagePostToMachine(ble->the, NULL, 0, bleServerCloseEvent, ble);
}

void xs_ble_server_destructor(void *data)
{
	modBLE ble = data;
	if (!ble) return;

	if (-1 != ble->conn_handle)
		sd_ble_gap_disconnect(ble->conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	
	c_free(ble);
	gBLE = NULL;

