Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEServer.c
				add_char_params.read_access = SEC_OPEN;
				add_char_params.write_access = SEC_OPEN;
				add_char_params.cccd_write_access = SEC_OPEN;

				att_handles[att_handle_index].service_index = i;
				att_handles[att_handle_index].att_index = j;
				err_code = characteristic_add(service_handles[i], &add_char_params, &att_handles[att_handle_index].handles);
				char_handle = att_handles[att_handle_index].handles.value_handle;
				++att_handle_index;
			}
			else if (0 == c_memcmp(att_desc->uuid_p, &character_client_config_uuid, sizeof(character_client_config_uuid))) {
				// Skip CCCD attributes because they are added by characteristic_add() above.
			}
			else if (2 == att_desc->uuid_length && (((*((uint16_t *)att_desc->uuid_p) & 0xFF00) >> 8) == 0x29)) {
				properties = *att_desc->value;
				permissions = att_desc->perm;
				
				c_memset(&add_desc_params, 0, sizeof(add_desc_params));
				if (UUID_LEN_128 == att_desc->uuid_length) {
					add_desc_params.uuid_type	= ble_service_uuid.type;
					add_desc_params.uuid		= (att_desc->uuid_p[13] << 8) | att_desc->uuid_p[12];
				}
				else {
					add_desc_params.uuid		= *(uint16_t*)att_desc->uuid_p;
				}
				add_desc_params.max_len			= att_desc->max_length;
				add_desc_params.init_len		= att_desc->length;
				add_desc_params.p_value			= att_desc->value;
				add_desc_params.is_var_len		= (NULL == att_desc->value);
				add_desc_params.is_defered_read	= (NULL == att_desc->value);
				
				add_desc_params.read_access = SEC_OPEN;
				add_desc_params.write_access = SEC_OPEN;

				att_handles[att_handle_index].service_index = i;
				att_handles[att_handle_index].att_index = j;
				err_code = descriptor_add(char_handle, &add_desc_params, &att_handles[att_handle_index].handles.value_handle);
				++att_handle_index;
			}
			else {
				xsUnknownError("unhandled attribute type");
			}
		}
	}
	if (NRF_SUCCESS != err_code)
		xsUnknownError("services deploy failed");
}

void xs_ble_server_set_security_parameters(xsMachine *the)
{
	uint8_t encryption = xsmcToBoolean(xsArg(0));
	uint8_t bonding = xsmcToBoolean(xsArg(1));
	uint8_t mitm = xsmcToBoolean(xsArg(2));
	uint8_t iocap = xsmcToInteger(xsArg(3));
	
	gBLE->encryption = encryption;
	gBLE->bonding = bonding;
	gBLE->mitm = mitm;
	gBLE->iocap = iocap;

	modBLESetSecurityParameters(encryption, bonding, mitm, iocap);
}

void xs_ble_server_passkey_input(xsMachine *the)
{
//	uint8_t *address = (uint8_t*)xsmcToArrayBuffer(xsArg(0));
	uint32_t passkey = xsmcToInteger(xsArg(1));
}

void xs_ble_server_passkey_reply(xsMachine *the)
{
	//uint8_t *address = (uint8_t*)xsmcToArrayBuffer(xsArg(0));
	uint8_t confirm = xsmcToBoolean(xsArg(1));
}

void xs_ble_server_get_service_attributes(xsMachine *the)
{
	ret_code_t err_code;
	uint16_t serviceIndex;
	uint8_t found = false;
	uint16_t length = xsGetArrayBufferLength(xsArg(0));
	uint8_t *buffer = xsmcToArrayBuffer(xsArg(0));
	for (serviceIndex = 0; !found && (serviceIndex < service_count); ++serviceIndex) {
		const gatts_attr_db_t *attr = &gatt_db[serviceIndex][0];
		if (attr->att_desc.length == length && 0 == c_memcmp(buffer, attr->att_desc.value, length)) {
			found = true;
			break;
		}
	}
	if (!found) return;

	xsmcVars(2);
	xsResult = xsmcNewArray(0);

	for (uint16_t i = 0; i < handles_count; ++i) {
		ble_uuid_t uuid;
		ble_gatts_value_t gatts_value;
		uint16_t handle;
		
		if (serviceIndex != att_handles[i].service_index)
			continue;
			
		handle = att_handles[i].handles.value_handle;
		
		xsVar(0) = xsmcNewObject();
		xsmcSetInteger(xsVar(1), handle);
		xsmcSet(xsVar(0), xsID_handle, xsVar(1));
			
		err_code = sd_ble_gatts_attr_get(handle, &uuid, NULL);
		if (NRF_SUCCESS == err_code) {
			uint8_t buffer[UUID_LEN_128];
			uint16_t uuid_length;
			uuidToBuffer(buffer, &uuid, &uuid_length);
			xsmcSetArrayBuffer(xsVar(1), buffer, uuid_length);
			xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
		}
		err_code = sd_ble_gatts_value_get(gBLE->conn_handle, handle, &gatts_value);
		if (NRF_SUCCESS == err_code && 0 != gatts_value.len) {
			xsmcSetArrayBuffer(xsVar(1), (uint8_t*)gatts_value.p_value, gatts_value.len);
			xsmcSet(xsVar(0), xsID_value, xsVar(1));
		}

		for (uint16_t j = 0; j < char_name_count; ++j) {
			if (att_handles[i].service_index == char_names[j].service_index && att_handles[i].att_index == char_names[j].att_index) {
				xsmcSetString(xsVar(1), (char*)char_names[j].name);
				xsmcSet(xsVar(0), xsID_name, xsVar(1));
				xsmcSetString(xsVar(1), (char*)char_names[j].type);
				xsmcSet(xsVar(0), xsID_type, xsVar(1));
				break;
			}
		}
			
		xsCall1(xsResult, xsID_push, xsVar(0));
	}
}

const char_name_table *handleToCharName(uint16_t handle) {
	for (uint16_t i = 0; i < handles_count; ++i) {
		ble_gatts_char_handles_t *handles = &att_handles[i].handles;
		if (handle == att_handles[i].handles.value_handle) {
			for (uint16_t k = 0; k < char_name_count; ++k) {
				if (char_names[k].service_index == att_handles[i].service_index && char_names[k].att_index == att_handles[i].att_index)
					return &char_names[k];
			}
		}
	}
	return NULL;
}

void bleServerReadyEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	xsBeginHost(the);
	xsCall1(gBLE->obj, xsID_callback, xsString("onReady"));
	xsEndHost(the);

	// Set appearance from app GAP service when available
	// Set device name from GAP service if app hasn't already set device name in onReady() callback
	ble_gap_conn_sec_mode_t sec_mode;
	char *device_name = NULL;
	uint16_t appearance = 128;	// generic computer
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	for (uint16_t i = 0; i < service_count; ++i) {
		gatts_attr_db_t *gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i];
		attr_desc_t *att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;
		if (UUID_LEN_16 == att_desc->uuid_length && 0x00 == att_desc->value[0] && 0x18 == att_desc->value[1]) {
			for (uint16_t j = 1; j < attribute_counts[i]; ++j) {
				att_desc = &gatts_attr_db[j].att_desc;
				if (0 == gBLE->deviceNameSet && UUID_LEN_16 == att_desc->uuid_length && 0x2A00 == *(uint16_t*)att_desc->uuid_p) {
					device_name = c_calloc(1, att_desc->length + 1);
					c_memmove(device_name, att_desc->value, att_desc->length);
				}
				if (UUID_LEN_16 == att_desc->uuid_length && 0x2A01 == *(uint16_t*)att_desc->uuid_p) {
					appearance = att_desc->value[1] << 8 | att_desc->value[0];
				}
			}
			break;
		}
	}
	
	sd_ble_gap_appearance_set(appearance);
	
	if (NULL != device_name) {
		sd_ble_gap_device_name_set(&sec_mode, device_name, c_strlen(device_name));
		c_free(device_name);
	}
	else if (0 == gBLE->deviceNameSet) {
		sd_ble_gap_device_name_set(&sec_mode, DEVICE_FRIENDLY_NAME, c_strlen(DEVICE_FRIENDLY_NAME));
	}
}

void bleServerCloseEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	modBLE ble = refcon;
	xs_ble_server_destructor(ble);
}

