Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEServer.c
void gapConnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	int16_t conn_handle = gap_evt->conn_handle;
	xsBeginHost(gBLE->the);
	if (BLE_CONN_HANDLE_INVALID != gBLE->conn_handle)
		goto bail;
	gBLE->conn_handle = conn_handle;
	gBLE->remote_bda = gap_evt->params.connected.peer_addr;
	xsmcVars(3);
	xsVar(0) = xsmcNewObject();
	xsmcSetInteger(xsVar(1), conn_handle);
	xsmcSet(xsVar(0), xsID_connection, xsVar(1));
	xsmcSetArrayBuffer(xsVar(2), gBLE->remote_bda.addr, 6);
	xsmcSet(xsVar(0), xsID_address, xsVar(2));
	xsCall2(gBLE->obj, xsID_callback, xsString("onConnected"), xsVar(0));
bail:
	xsEndHost(gBLE->the);
}

void gapDisconnectedEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

    ret_code_t err_code;
	ble_gap_evt_t *gap_evt = (ble_gap_evt_t*)message;
	int16_t conn_handle = gap_evt->conn_handle;
	
	if (conn_handle != gBLE->conn_handle) return;
	xsBeginHost(gBLE->the);
	gBLE->conn_handle = BLE_CONN_HANDLE_INVALID;
	xsmcVars(3);
	xsVar(0) = xsmcNewObject();
	xsmcSetInteger(xsVar(1), conn_handle);
	xsmcSet(xsVar(0), xsID_connection, xsVar(1));
	xsmcSetArrayBuffer(xsVar(2), gBLE->remote_bda.addr, 6);
	xsmcSet(xsVar(0), xsID_address, xsVar(2));
	xsCall2(gBLE->obj, xsID_callback, xsString("onDisconnected"), xsVar(0));
	xsEndHost(gBLE->the);
}

static void gapAuthStatusEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	ble_gap_evt_auth_status_t const * p_evt_auth_status = (ble_gap_evt_auth_status_t const *)message;
	if (BLE_GAP_SEC_STATUS_SUCCESS == p_evt_auth_status->auth_status) {
		xsBeginHost(gBLE->the);
		xsCall1(gBLE->obj, xsID_callback, xsString("onAuthenticated"));
		xsEndHost(gBLE->the);
	}
}

void gattsWriteEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;

	const char_name_table *char_name;
	ble_uuid_t uuid;
	uint16_t uuid_length;
	uint8_t buffer[UUID_LEN_128];
	ble_gatts_evt_write_t const * p_evt_write = (ble_gatts_evt_write_t const *)message;
	uint8_t notify = 0xFF;
	uint16_t handle = BLE_GATT_HANDLE_INVALID;

	for (uint16_t i = 0; BLE_GATT_HANDLE_INVALID == handle && i < handles_count; ++i) {
		if (p_evt_write->handle == att_handles[i].handles.cccd_handle && p_evt_write->len == 2) {
			notify = ble_srv_is_notification_enabled(p_evt_write->data);
			handle = p_evt_write->handle - 1;
		}
		else if (p_evt_write->handle == att_handles[i].handles.value_handle) {
			handle = p_evt_write->handle;
		}
	}
	if (BLE_GATT_HANDLE_INVALID == handle)
		return;
	
	xsBeginHost(gBLE->the);
	xsmcVars(2);
	char_name = handleToCharName(handle);
	sd_ble_gatts_attr_get(handle, &uuid, NULL);
	uuidToBuffer(buffer, &uuid, &uuid_length);
	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), buffer, uuid_length);
	xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
	if (char_name) {
		xsmcSetString(xsVar(1), (char*)char_name->name);
		xsmcSet(xsVar(0), xsID_name, xsVar(1));
		xsmcSetString(xsVar(1), (char*)char_name->type);
		xsmcSet(xsVar(0), xsID_type, xsVar(1));
	}
	xsmcSetInteger(xsVar(1), handle);
	xsmcSet(xsVar(0), xsID_handle, xsVar(1));
	if (0xFF == notify) {
		xsmcSetArrayBuffer(xsVar(1), (uint8_t*)p_evt_write->data, p_evt_write->len);
		xsmcSet(xsVar(0), xsID_value, xsVar(1));
		xsCall2(gBLE->obj, xsID_callback, xsString("onCharacteristicWritten"), xsVar(0));
	}
	else {
		xsmcSetInteger(xsVar(1), notify);
		xsmcSet(xsVar(0), xsID_notify, xsVar(1));
		xsCall2(gBLE->obj, xsID_callback, xsString(0 == notify ? "onCharacteristicNotifyDisabled" : "onCharacteristicNotifyEnabled"), xsVar(0));
	}
	
bail:
	xsEndHost(gBLE->the);
}

void gattsReadAuthRequestEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gatts_evt_read_t const * read = (ble_gatts_evt_read_t const *)message;
	const char_name_table *char_name;
	uint8_t buffer[UUID_LEN_128];
	uint16_t uuid_length;

	char_name = handleToCharName(read->handle);

	uuidToBuffer(buffer, (ble_uuid_t *)&read->uuid, &uuid_length);

	xsBeginHost(gBLE->the);
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), buffer, uuid_length);
	xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
	xsmcSetInteger(xsVar(1), read->handle);
	xsmcSet(xsVar(0), xsID_handle, xsVar(1));
	if (char_name) {
		xsmcSetString(xsVar(1), (char*)char_name->name);
		xsmcSet(xsVar(0), xsID_name, xsVar(1));
		xsmcSetString(xsVar(1), (char*)char_name->type);
		xsmcSet(xsVar(0), xsID_type, xsVar(1));
	}
	xsResult = xsCall2(gBLE->obj, xsID_callback, xsString("onCharacteristicRead"), xsVar(0));
	if (xsUndefinedType != xsmcTypeOf(xsResult)) {
		ble_gatts_rw_authorize_reply_params_t auth_reply;
		c_memset(&auth_reply, 0, sizeof(auth_reply));
		auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
		auth_reply.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
		auth_reply.params.read.update = 1;
		auth_reply.params.read.len = xsGetArrayBufferLength(xsResult);
		auth_reply.params.read.p_data = xsmcToArrayBuffer(xsResult);
		sd_ble_gatts_rw_authorize_reply(gBLE->conn_handle, &auth_reply);
	}
	xsEndHost(gBLE->the);
}

void gattsWriteAuthRequestEvent(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	if (!gBLE) return;
	
	ble_gatts_evt_write_t const * write = (ble_gatts_evt_write_t const *)write;
	const char_name_table *char_name;
	uint8_t buffer[UUID_LEN_128];
	uint16_t uuid_length;

	char_name = handleToCharName(write->handle);

	uuidToBuffer(buffer, (ble_uuid_t *)&write->uuid, &uuid_length);

	xsBeginHost(gBLE->the);
	xsmcVars(2);
	xsVar(0) = xsmcNewObject();
	xsmcSetArrayBuffer(xsVar(1), buffer, uuid_length);
	xsmcSet(xsVar(0), xsID_uuid, xsVar(1));
	xsmcSetInteger(xsVar(1), write->handle);
	xsmcSet(xsVar(0), xsID_handle, xsVar(1));
	if (char_name) {
		xsmcSetString(xsVar(1), (char*)char_name->name);
		xsmcSet(xsVar(0), xsID_name, xsVar(1));
		xsmcSetString(xsVar(1), (char*)char_name->type);
		xsmcSet(xsVar(0), xsID_type, xsVar(1));
	}
	xsmcSetArrayBuffer(xsVar(1), (uint8_t*)write->data, write->len);
	xsmcSet(xsVar(0), xsID_value, xsVar(1));
	xsCall2(gBLE->obj, xsID_callback, xsString("onCharacteristicWritten"), xsVar(0));
	
	ble_gatts_rw_authorize_reply_params_t auth_reply;
	c_memset(&auth_reply, 0, sizeof(auth_reply));
	auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
	auth_reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
	auth_reply.params.write.update = 1;
	auth_reply.params.write.len = write->len;
	auth_reply.params.read.p_data = write->data;
	sd_ble_gatts_rw_authorize_reply(gBLE->conn_handle, &auth_reply);

	xsEndHost(gBLE->the);
}

